In [44]:
import pandas as pd
dataset = pd.read_csv(r"C:\Users\Rajsh\projects\new loan dataset\new loan dataset.csv\test_Y3wMUE5_7gLdaTN.csv")

dataset.head(10)

In [12]:
dataset.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [15]:
dataset["Gender"].fillna(dataset["Gender"].mode()[0], inplace=True)

In [16]:
dataset["Married"].fillna(dataset["Married"].mode()[0], inplace=True)

In [18]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [23]:
en_data = dataset[["Gender", "Married"]]

In [24]:
pd.get_dummies(en_data)

     Gender_Female  Gender_Male  Married_No  Married_Yes
0            False         True       False         True
1            False         True       False         True
2            False         True       False         True
3            False         True       False         True
4            False         True        True        False
..             ...          ...         ...          ...
362          False         True       False         True
363          False         True       False         True
364          False         True        True        False
365          False         True       False         True
366          False         True        True        False

[367 rows x 4 columns]

In [25]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_Female  367 non-null    bool
 1   Gender_Male    367 non-null    bool
 2   Married_No     367 non-null    bool
 3   Married_Yes    367 non-null    bool
dtypes: bool(4)
memory usage: 1.6 KB

In [29]:
from sklearn.preprocessing import OneHotEncoder

In [31]:
ohe = OneHotEncoder()

In [33]:
ohe.fit_transform(en_data).toarray()

array([[0., 1., 0., 1.],
       [0., 1., 0., 1.],
       [0., 1., 0., 1.],
       ...,
       [0., 1., 1., 0.],
       [0., 1., 0., 1.],
       [0., 1., 1., 0.]], shape=(367, 4))

In [34]:
ar = ohe.fit_transform(en_data).toarray()

In [37]:
pd.DataFrame(ar, columns = ["Gender_Female",	"Gender_Male", "Married_No", "Married_Yes"])

     Gender_Female  Gender_Male  Married_No  Married_Yes
0              0.0          1.0         0.0          1.0
1              0.0          1.0         0.0          1.0
2              0.0          1.0         0.0          1.0
3              0.0          1.0         0.0          1.0
4              0.0          1.0         1.0          0.0
..             ...          ...         ...          ...
362            0.0          1.0         0.0          1.0
363            0.0          1.0         0.0          1.0
364            0.0          1.0         1.0          0.0
365            0.0          1.0         0.0          1.0
366            0.0          1.0         1.0          0.0

[367 rows x 4 columns]

In [38]:
ohe = OneHotEncoder(drop = "first")

In [39]:
ar = ohe.fit_transform(en_data).toarray()

In [42]:
pd.DataFrame(ar, columns = ["Gender_Male", "Married_Yes"])

     Gender_Male  Married_Yes
0            1.0          1.0
1            1.0          1.0
2            1.0          1.0
3            1.0          1.0
4            1.0          0.0
..           ...          ...
362          1.0          1.0
363          1.0          1.0
364          1.0          0.0
365          1.0          1.0
366          1.0          0.0

[367 rows x 2 columns]

In [45]:
# lable encoding 
import pandas as pd

In [65]:
df = pd.DataFrame({"Name":["Appwars","Python","Sql","Ml","Powerbi","Llm","Appwars","Python","Sql","Ml","Powerbi","Llm"]})

In [66]:
df

       Name
0   Appwars
1    Python
2       Sql
3        Ml
4   Powerbi
5       Llm
6   Appwars
7    Python
8       Sql
9        Ml
10  Powerbi
11      Llm

In [67]:
from sklearn.preprocessing import LabelEncoder

In [68]:
le = LabelEncoder()

In [69]:
le.fit_transform(df["Name"])

array([0, 4, 5, 2, 3, 1, 0, 4, 5, 2, 3, 1])

In [70]:
df["en_name"] = le.fit_transform(df["Name"])

In [71]:
df

       Name  en_name
0   Appwars        0
1    Python        4
2       Sql        5
3        Ml        2
4   Powerbi        3
5       Llm        1
6   Appwars        0
7    Python        4
8       Sql        5
9        Ml        2
10  Powerbi        3
11      Llm        1